## TERRAGRUNT Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/7582bc74-ac86-43ee-876a-47ac4999335a/terraform-bin plan -no-color

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.test_1 will be created
  + resource "aws_s3_bucket" "test_1" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Enviroment" = "Dev"
          + "Name"       = "My bucket"
        }
      + tags_all                    = {
          + "Enviroment" = "Dev"
          + "Name"       = "My bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_object.test_2 will be created
  + resource "aws_s3_object" "test_2" {
      + acl                    = (known after apply)
      + bucket                 = "my-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "terraform.tfstate"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "terraform.tfstate"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: AWS account ID not found for provider

  with provider["registry.terraform.io/hashicorp/aws"],
  on provider.tf line 2, in provider "aws":
   2: provider "aws" {

See
https://registry.terraform.io/providers/hashicorp/aws/latest/docs#skip_requesting_account_id
for implications.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_bucket.test_1 will be created%0A  + resource "aws_s3_bucket" "test_1" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "my-bucket"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Enviroment" = "Dev"%0A          + "Name"       = "My bucket"%0A        }%0A      + tags_all                    = {%0A          + "Enviroment" = "Dev"%0A          + "Name"       = "My bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # aws_s3_object.test_2 will be created%0A  + resource "aws_s3_object" "test_2" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "my-bucket"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = (known after apply)%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "terraform.tfstate"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "terraform.tfstate"%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A%0AWarning: AWS account ID not found for provider%0A%0A  with provider["registry.terraform.io/hashicorp/aws"],%0A  on provider.tf line 2, in provider "aws":%0A   2: provider "aws" {%0A%0ASee%0Ahttps://registry.terraform.io/providers/hashicorp/aws/latest/docs#skip_requesting_account_id%0Afor implications.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>